In [1]:
import pandas as pd
import numpy as np

In [2]:
df1 = pd.DataFrame([[12, 26, 1995, 'Sai Raghavendra', 'Birthday'],
                     [12, 25, 1995, 'Boxing Day', 'Special Event'],
                     [1, 9, 2000, 'Aiswarya', 'Birthday' ]],
                     columns=['Month','Day','Year', 'Event', 'holiday'])

In [3]:
df1

   Month  Day  Year            Event        holiday
0     12   26  1995  Sai Raghavendra       Birthday
1     12   25  1995       Boxing Day  Special Event
2      1    9  2000         Aiswarya       Birthday

In [4]:
df1['date'] = pd.to_datetime(df1[['Month','Day','Year']])
df1

   Month  Day  Year            Event        holiday       date
0     12   26  1995  Sai Raghavendra       Birthday 1995-12-26
1     12   25  1995       Boxing Day  Special Event 1995-12-25
2      1    9  2000         Aiswarya       Birthday 2000-01-09

In [5]:
df1.drop(['Month','Day','Year'], axis=1)

             Event        holiday       date
0  Sai Raghavendra       Birthday 1995-12-26
1       Boxing Day  Special Event 1995-12-25
2         Aiswarya       Birthday 2000-01-09

In [6]:
df1.dtypes

Month               int64
Day                 int64
Year                int64
Event              object
holiday            object
date       datetime64[ns]
dtype: object